src/main/java/resources/BA_AirShoppingRQ_172.xml

	<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header />
  <S:Body>
	    <AirShoppingRQ xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" Version="17.2" xmlns="http://www.iata.org/IATA/EDIST/2017.2">
      <Document>
        <Name>#AIRLINECODE#</Name>
      </Document>
      <Party>
        <Sender>
          <TravelAgencySender>
            <Type>Offline</Type>
            <Contacts>
              <Contact>
                <AddressContact>
                  <Street>TESTT ADDR1</Street>
                  <Street>TESTT ADDR2</Street>
                  <CityName>LON</CityName>
                  <PostalCode>120000</PostalCode>
                  <CountryCode>GB</CountryCode>
                </AddressContact>
                <EmailContact>
                  <Address>ndc@ba.com</Address>
                </EmailContact>
              </Contact>
            </Contacts>
            <IATA_Number>00000136</IATA_Number>
            <AgencyID>TSN111</AgencyID>
          </TravelAgencySender>
        </Sender>
        <Participants>
          <Participant>
            <AggregatorParticipant SequenceNumber="1">
              <Name>Trippep.com</Name>
              <AggregatorID>00089810</AggregatorID>
            </AggregatorParticipant>
          </Participant>
        </Participants>
      </Party>
      <CoreQuery>
        <OriginDestinations>
          #ORIGDEST#
        </OriginDestinations>
      </CoreQuery>
      <Preference>
        <FarePreferences>
          <Types>
            <Type>759</Type>
          </Types>
        </FarePreferences>
        <CabinPreferences>
          <CabinType>
            <Code>5</Code>
          </CabinType>
        </CabinPreferences>
      </Preference>
      <DataLists>
        <PassengerList>
          #TRAVELER#
        </PassengerList>
      </DataLists>
    </AirShoppingRQ>
  </S:Body>
</S:Envelope>